import { News } from "../../entities/news";

export const MOCK_NEWS = [
  new News({
    id: 1,
    title: 'Официальное открытие мотосезона в Беларуси отменили из-за коронавируса',
    image: "",
    description: 'Официального открытия мотосезона в этом году не будет, такое решение приняли организаторы мероприятия "Ассоциация мотоклубов Беларуси" из-за угрозы распространения коронавируса. "Уважаемые мотоциклисты! IRON PRIDE MC вынуждены сообщить об отмене мероприятий, связанных с Республиканским открытием мотосезона-2020, запланированных на 25 апреля в Минске, в связи с распространением коронавирусной инфекции", – сообщили там. Там также предупредили, что из-за неблагоприятной эпидемиологической ситуации перенесут специализированную выставку "Мотовелоэкспо", которая традиционно проводится в апреле. В этом году мероприятие должно было пройти 25-26 апреля в агрогородке Щомыслица на площадке ТЛЦ "Глобус Парк". "Наша твердая гражданская позиция призывает нас обезопасить мотосообщество и дорогих и близких людей. Искренне надеемся на благополучное завершение данной ситуации в скорейшем будущем", – отметили в Ассоциации мотоклубов Беларуси. В прошлом году выставку "Мотовелоэкспо" посетили более 17 тысяч человек. В ходе выставки прошел открытый чемпионат Беларуси по кастомайзингу и аэрографии мотоциклов и велосипедов, этап открытого чемпионата страны по дрифт-трайкингу, открытый кросс-кантри и другие соревнования. Проводился и традиционный парад байкеров. Мотоциклисты собрались у Ледового дворца спорта и затем колонной проехали до Щомыслицы, где проходила выстака. В нем участвовали мотоциклисты со всей Беларуси, а также гости из России, Польши, Украины.',
    author: 'sputnik.by',
    category: 'Road',
    releaseDate: '21/03/2021'
  }),

  new News({
    id: 2,
    title: 'Имя победительницы конкурса «Миссис Вселенная Беларусь» назовут на днях. Голосуйте за представительницу Минска!',
    url: '',
    image: '',
    description: 'Жительница нашего города Анна Купрюшина участвует в конкурсе красоты и таланта «Мисс Вселенная Беларусь 2021». Пятерку победителей будет определять жюри, но есть номинации, где самую красивую миссис могут выбирать зрители. Горожанка надеется, что земляки поддержат ее. Молодая и красивая девушка из Минска попала на конкурс «Мисс Вселенная Беларусь» случайно. Но в итоге дошла до финала: он состоится 8 марта в Минске. Пятерку победительниц конкурса будет определять профессиональное жюри. Но, как и во многих подобных бьюти-состязаниях, в «Мисс Вселенная Беларусь» есть номинации, победительниц которых выберут зрители. Голосование, к слову, уже началось. И Аня очень «надеется на своих» и ждет, что жители Барановичского региона проголосуют за нее. – Уже сейчас я чувствую огромную поддержку. И с работы разослали по филиалам сообщения с просьбой поддержать меня, и все родственники, друзья репосты делают. Даже люди, которых я совсем не знаю, репостят и пишут красивые слова. Это так приятно! Тут уже не сам конкурс и его результаты важны, как эта поддержка, – говорит Анна Купрюшина. Зрительское голосование идет сразу на двух интернет-площадках: на сайте организаторов конкурса и на страничке конкурса в Instagram. Голосовать нужно НА ОБЕИХ площадках! Чтобы поддержать Аню, просто переходите по ссылкам и выполняйте условия голосования.',
    author: 'Kiryl Duben',
    category: 'beauty',
    releaseDate: '18/02/2021'
  }),

  new News({
    id: 3,
    title: '«Роскошные лицо и фигура!»: двойник Мэрилин Монро вызвала ажиотаж в Сети',
    url: '',
    image: '',
    description: 'Жительница нашего города Елена Агафонова поразила сходством с голливудской звездой Мэрилин Монро (Marilyn Monroe). Девушка приложила для этого максимум усилий. Образ кинодивы, которая умерла в 36-летнем возрасте, вдохновил одну из ее поклонниц. Уроженка Минска сделала всё возможное, чтобы скопировать имидж культовой красотки. Елена восхитила пользователей своей внешностью. Она делает аналогичный грим и носит винтажные вещи, которые напоминают аутфиты артистки. Число поклонников Лены превысило 100 тысяч. Многие называют красотку копией актрисы, неподражаемый стиль которой по-прежнему будоражит сознание мужчин.  «Ого, одна из самых приближенных к "оригиналу"», «Крутая, супер», «Как похожи! Копия актрисы!», «Нереальное сходство!», «Как похожа! Очень красивая, мне понравилась!», «Роскошные лицо и фигура!» — прокомментировали фолловеры.',
    author: 'Kiryl Duben',
    category: 'star',
    releaseDate: '01/01/2021'
  }),

  new News({
    id: 3,
    title: 'Артем Барташевич бросил вызов легендарному человеку-коту из Америки!',
    url: '',
    image: '',
    description: 'Артем Барташевич, наш одногрупник — широко известный как «Человек-котяра», хотя сам Артем предпочитал своё индейское имя «Крадущийся кот» (англ. Stalking Cat). Артем стал известен тем, что потратил огромное количество средств на модификацию собственного тела, чтобы стать похожим на антропоморфного тигра. Артем сам всегда говорил, что не считал средства, потраченные на модификации собственного тела, хотя в некоторых источниках такие оценки приводятся. Он приобрел необычный внешний вид, стал местной знаменитостью и часто ездил по Беларуси для участия в интервью и фотосессиях. Многие из модификаций тела Артема были выполнены художником Стивом Хэвортом из Аризоны.',
    author: 'Kiryl Duben',
    category: 'star',
    releaseDate: '01/01/2021'
  }),

  new News({
    id: 3,
    title: '«Роскошные лицо и фигура!»: двойник Мэрилин Монро вызвала ажиотаж в Сети',
    url: '',
    image: '',
    description: 'Артем Барташевич, наш одногрупник — широко известный как «Человек-кот», хотя сам Артем предпочитал своё индейское имя «Крадущийся кот» (англ. Stalking Cat). Артем стал известен тем, что потратил огромное количество средств на модификацию собственного тела, чтобы стать похожим на антропоморфного тигра. Артем сам всегда говорил, что не считал средства, потраченные на модификации собственного тела, хотя в некоторых источниках такие оценки приводятся. Он приобрел необычный внешний вид, стал местной знаменитостью и часто ездил по Беларуси для участия в интервью и фотосессиях. Многие из модификаций тела Артема были выполнены художником Стивом Хэвортом из Аризоны.',
    author: 'Kiryl Duben',
    category: 'star',
    releaseDate: '01/01/2021'
  }),
]