import { News } from "../../entities/news";

export const MOCK_NEWS = [
  new News({
    id: 1,
    title: 'Официальное открытие мотосезона в Беларуси отменили из-за коронавируса',
    url: 'https://afisha.relax.by/event/10343712-motoveloekspo/minsk/',
    image: "Леша",
    description: 'Официального открытия мотосезона в этом году не будет, такое решение приняли организаторы мероприятия "Ассоциация мотоклубов Беларуси" из-за угрозы распространения коронавируса. "Уважаемые мотоциклисты! IRON PRIDE MC вынуждены сообщить об отмене мероприятий, связанных с Республиканским открытием мотосезона-2020, запланированных на 25 апреля в Минске, в связи с распространением коронавирусной инфекции", – сообщили там. Там также предупредили, что из-за неблагоприятной эпидемиологической ситуации перенесут специализированную выставку "Мотовелоэкспо", которая традиционно проводится в апреле. В этом году мероприятие должно было пройти 25-26 апреля в агрогородке Щомыслица на площадке ТЛЦ "Глобус Парк". "Наша твердая гражданская позиция призывает нас обезопасить мотосообщество и дорогих и близких людей. Искренне надеемся на благополучное завершение данной ситуации в скорейшем будущем", – отметили в Ассоциации мотоклубов Беларуси. В прошлом году выставку "Мотовелоэкспо" посетили более 17 тысяч человек. В ходе выставки прошел открытый чемпионат Беларуси по кастомайзингу и аэрографии мотоциклов и велосипедов, этап открытого чемпионата страны по дрифт-трайкингу, открытый кросс-кантри и другие соревнования. Проводился и традиционный парад байкеров. Мотоциклисты собрались у Ледового дворца спорта и затем колонной проехали до Щомыслицы, где проходила выстака. В нем участвовали мотоциклисты со всей Беларуси, а также гости из России, Польши, Украины.',
    author: 'sputnik.by',
    category: 'Road',
    releaseDate: '21/03/2021'
  }),

  new News({
    id: 2,
    title: 'Имя победительницы конкурса «Миссис Вселенная Беларусь» назовут на днях. Голосуйте за представительницу Минска!',
    url: 'https://www.instagram.com/missbelarus_2020/?hl=ru',
    image: 'Аня',
    description: 'Жительница нашего города Анна Купрюшина участвует в конкурсе красоты и таланта «Мисс Вселенная Беларусь 2021». Пятерку победителей будет определять жюри, но есть номинации, где самую красивую миссис могут выбирать зрители. Горожанка надеется, что земляки поддержат ее. Молодая и красивая девушка из Минска попала на конкурс «Мисс Вселенная Беларусь» случайно. Но в итоге дошла до финала: он состоится 8 марта в Минске. Пятерку победительниц конкурса будет определять профессиональное жюри. Но, как и во многих подобных бьюти-состязаниях, в «Мисс Вселенная Беларусь» есть номинации, победительниц которых выберут зрители. Голосование, к слову, уже началось. И Аня очень «надеется на своих» и ждет, что жители Барановичского региона проголосуют за нее. – Уже сейчас я чувствую огромную поддержку. И с работы разослали по филиалам сообщения с просьбой поддержать меня, и все родственники, друзья репосты делают. Даже люди, которых я совсем не знаю, репостят и пишут красивые слова. Это так приятно! Тут уже не сам конкурс и его результаты важны, как эта поддержка, – говорит Анна Купрюшина. Зрительское голосование идет сразу на двух интернет-площадках: на сайте организаторов конкурса и на страничке конкурса в Instagram. Голосовать нужно НА ОБЕИХ площадках! Чтобы поддержать Аню, просто переходите по ссылкам и выполняйте условия голосования.',
    author: 'Kiryl Duben',
    category: 'beauty',
    releaseDate: '18/02/2021'
  }),

  new News({
    id: 3,
    title: '«Роскошные лицо и фигура!»: двойник Мэрилин Монро вызвала ажиотаж в Сети',
    url: 'https://ru.wikipedia.org/wiki/%D0%9C%D1%8D%D1%80%D0%B8%D0%BB%D0%B8%D0%BD_%D0%9C%D0%BE%D0%BD%D1%80%D0%BE',
    image: 'Лена',
    description: 'Жительница нашего города Елена Агафонова поразила сходством с голливудской звездой Мэрилин Монро (Marilyn Monroe). Девушка приложила для этого максимум усилий. Образ кинодивы, которая умерла в 36-летнем возрасте, вдохновил одну из ее поклонниц. Уроженка Минска сделала всё возможное, чтобы скопировать имидж культовой красотки. Елена восхитила пользователей своей внешностью. Она делает аналогичный грим и носит винтажные вещи, которые напоминают аутфиты артистки. Число поклонников Лены превысило 100 тысяч. Многие называют красотку копией актрисы, неподражаемый стиль которой по-прежнему будоражит сознание мужчин.  «Ого, одна из самых приближенных к "оригиналу"», «Крутая, супер», «Как похожи! Копия актрисы!», «Нереальное сходство!», «Как похожа! Очень красивая, мне понравилась!», «Роскошные лицо и фигура!» — прокомментировали фолловеры.',
    author: 'Kiryl Duben',
    category: 'star',
    releaseDate: '01/01/2021'
  }),

  new News({
    id: 4,
    title: 'Артем Барташевич бросил вызов легендарному человеку-коту из Америки!',
    url: 'https://ru.wikipedia.org/wiki/%D0%90%D0%BC%D1%83%D1%80%D1%81%D0%BA%D0%B8%D0%B9_%D1%82%D0%B8%D0%B3%D1%80',
    image: 'Артем',
    description: 'Артем Барташевич, наш одногрупник — широко известный как «Человек-котяра», хотя сам Артем предпочитал своё индейское имя «Крадущийся кот» (англ. Stalking Cat). Артем стал известен тем, что потратил огромное количество средств на модификацию собственного тела, чтобы стать похожим на антропоморфного тигра. Артем сам всегда говорил, что не считал средства, потраченные на модификации собственного тела, хотя в некоторых источниках такие оценки приводятся. Он приобрел необычный внешний вид, стал местной знаменитостью и часто ездил по Беларуси для участия в интервью и фотосессиях. Многие из модификаций тела Артема были выполнены художником Стивом Хэвортом из Аризоны.',
    author: 'Kiryl Duben',
    category: 'star',
    releaseDate: '01/01/2021'
  }),

  new News({
    id: 5,
    title: 'Король-лич, после долгих странствий, нашел с столице Беларуси свой трон!',
    url: 'https://wowwiki.fandom.com/ru/wiki/%D0%9A%D0%BE%D1%80%D0%BE%D0%BB%D1%8C-%D0%BB%D0%B8%D1%87',
    image: 'Макс Зубрицкий',
    description: 'Король-лич является владыкой и повелителем Плети, которой он телепатически правит со своего Ледяного Трона, стоящего на верхушке Цитадели Ледяной Короны. Килджеден создал Короля-лича из духа орка, шамана Нерзула, чтобы тот поднял армию нежити и завоевал Азерот для Пылающего Легиона. Первоначально заточённый в ловушке Ледяного Трона с Ледяной Скорбью, Король-лич в конце концов предал Килджедена и объединился с человеком Артасом Менетилом. С разрушением Ледяной Скорби и смертью Артаса, Болвар Фордрагон принял полномочия Короля-лича. Когда Нерзул попытался сбежать из Дренора, он был немедленно задержан лордом демонов Килджеденом. Килджеден уничтожил его тело, но сохранил его дух в живых. Килджеден поставил беспомощный дух Нерзула перед последним выбором между службой Легиону и вечными муками. И вновь Нерзул принял условия демона. Заточенный в ледяной тюрьме Нерзул почувствовал, что возможности его разума возросли тысячекратно. Наделенный огромной силой демона, он стал невероятно могущественным духом. В этот момент орк по имени Нерзул перестал существовать, и на свет появился Король-лич.',
    author: 'Kiryl Duben',
    category: 'monster',
    releaseDate: '07/02/2021'
  }),

  new News({
    id: 6,
    title: 'Сисадмины умрут, эникейщики будут жить вечно? Куда бегут «железячники» из вымирающей профессии',
    url: 'https://dev.by/news/mtc-cloud-3',
    image: 'Кирилл',
    description: 'Ещё 10-15 лет назад сисадмины были везде: они правили бал в компьютерных клубах, настраивали компы неумелых офисных клерков и в зубах тащили провода по подъездам спальных районов. За последние годы многое изменилось, и классического (нелюдимого и волосатого) сисадмина днём с огнём не сыщешь. Вместе с МТС Cloud мы собрали три истории бывших администраторов, чтобы понять, в каких профессиях они себя нашли. Дмитрий, архитектор решений в Squalio Belarus: «DevOps-специалистам готовы платить на 30% больше, чем сисадминам» Моя сисадминская карьера началась с авиации МЧС — по образованию я инженер радиоэлектронного оборудования в авиационной сфере. Два года я отдавал долг родине: следил за исправностью связи воздушных судов с землёй и входил в группу, которая занималась информационной безопасностью. Группа состояла из одного человека — меня. Я с нуля создал локально-вычислительную сеть на территории аэродрома: закупил всё оборудование, расписал план сети и передал дела преемнику. После МЧС я работал в сети ритейловых магазинов. Магазины уже были объединены в единую сеть, и к каждому гипермаркету был приписан свой сисадмин, который следил за её исправностью. Я поддерживал работу строительного гипермаркета в Новинках: wi-fi-покрытие, серверное и фаервольное оборудование, почта, администрирование, ПО для продаж и работы складов. Короче говоря, классическая работа сисадмина. Затем я оказался в компании, которая занимается разработкой и модернизацией зенитно-ракетных комплексов. В работе сисадмина ключевую роль играет количество пользователей, которых он должен обслуживать. Там их было уже 350. Это довольно много, поэтому работали вдвоём с напарником. В компании было конструкторское бюро, а значит приходилось много работать с печатной техникой. Самое «любимое» дело сисадминов — заправлять картриджи! ',
    author: 'Kiryl Duben',
    category: 'admin',
    releaseDate: '24/12/2020'
  }),

  new News({
    id: 7,
    title: 'Белорусские программисты - лучшие в Восточной Европе? Что советуют бизнесу ФРГ',
    url: 'https://www.dw.com/ru/%D0%B1%D0%B5%D0%BB%D0%BE%D1%80%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B5-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%81%D1%82%D1%8B-%D0%BB%D1%83%D1%87%D1%88%D0%B8%D0%B5-%D0%B2-%D0%B2%D0%BE%D1%81%D1%82%D0%BE%D1%87%D0%BD%D0%BE%D0%B9-%D0%B5%D0%B2%D1%80%D0%BE%D0%BF%D0%B5-%D1%87%D1%82%D0%BE-%D1%81%D0%BE%D0%B2%D0%B5%D1%82%D1%83%D1%8E%D1%82-%D0%B1%D0%B8%D0%B7%D0%BD%D0%B5%D1%81%D1%83-%D1%84%D1%80%D0%B3/a-53928444',
    image: 'Виталик',
    description: 'Успех белорусской IT-индустрии, которая уже вносит существенный вклад в экспорт и ВВП Беларуси, показывает: благоприятный регуляторный режим позволяет за считанные годы создать инвестиционный климат, обеспечивающий приток частных фирм и капиталовложений, подчеркнул в беседе с DW Роберт Кирхнер (Robert Kirchner), заместитель руководителя Немецкой экономической группы (German Economic Team, GET). Эта финансируемая министерством экономики ФРГ команда экспертов консультирует правительства целого ряда постсоветских стран, в том числе Беларуси. Ключевые импульсы развитию IT-индустрии в Беларуси дал и дает "Парк высоких технологий", на это указывали все собеседники DW. Парк был создан президентским указом в 2005 году, в 2014 году были существенно расширены виды деятельности, получающие льготы от государства. У парка есть административный центр с офисными помещениями в Минске, но это все же не географическое, а правовое понятие. Иными словами, его резидентами и, соответственно, получателями льгот могут быть компании на всей территории Беларуси. Как отметил Роберт Кирхнер, Беларуси требуется двойная диверсификация ее экономики, и вызванный пандемией коронавируса кризис сделал эту задачу еще более насущной. По словам эксперта, "Беларуси необходимо сейчас диверсифицировать как экспортные рынки, так и ассортимент экспортной продукции". Белорусская IT-индустрия, решившая активно налаживать в этом году связи с Германией, в том числе путем видеоконференций, может способствовать и тому, и другому.',
    author: 'Kiryl Duben',
    category: 'topchick',
    releaseDate: '18/09/2020'
  }),

  new News({
    id: 8,
    title: 'Вопрос дня: не поздно ли начинать карьеру программиста почти в 40 лет?',
    url: 'https://proglib.io/p/late-beginning/',
    image: 'Я',
    description: 'Кажется, что не этот вопрос уже неоднократно отвечали, но тогда почему люди среднего возраста всё ещё считают, что учиться новому уже поздно? Конечно, изменение карьеры в этом возрасте пугает ввиду постоянных расходов, появляется желание оставить всё как есть. Но стабильность хороша далеко не всегда. Это же очевидно, что научиться программировать можно и в 15, и в 30, и в 40, и даже в 60, если вы готовы приложить усилия для этого. Сейчас в интернете полно рассказов о том, как люди переучиливались, рисковали и уходили с работы, чтобы посвятить жизнь программированию. Любой риск оправдан, представьте, что вам предстоит покорить Эверест. Наверняка, вы понимаете, что будет тяжело, но результативно. Так вот, изучить языки программирования, построить карьеру программиста новичку проще, чем взобраться на Эверест. Почему люди думают, что они стары для IT. Самая частая причина − они просто боятся, что изучение новой сферы будет означать, что все предыдущие годы прошли впустую. На самом деле, не стоит устрашать работу в IT: да, в среднем, здесь более молодые сотрудники, но они тоже постоянно пытаются изучать всё больше, чтобы не отставать от коллег. Так что IT − это про постоянное обучение, конкуренцию. Тем более, существует много примеров, когда люди получали управленческие должности и эффективно выполняли работу, а их сверстники в это же самое время проводили часы, беспокоясь о том, как бы лишний раз себя не напрягать. Поддерживать активность мозга − единственный выход сохранить здоровье. И изучение сложных технологий может помочь в этом. Вторая частая причина − боязнь того, что молодым заплатят больше, даже при одинаковой эффективности. На самом деле, иногда так и происходит. Но! Многое зависит от мотивации и если вы серьезно относитесь делу, то рано или поздно преодолеете этот барьер. Тем более, что программистам и так неплохо платят. Найти повод для того, чтобы ничего не делать, можно всегда. Но не будете ли вы потом жалеть о своём выборе?',
    author: 'Kiryl Duben',
    category: 'pensiya',
    releaseDate: '31/07/2020'
  }),

  new News({
    id: 9,
    title: 'Мой первый учитель.',
    url: 'http://sdam-na5.ru/raznye-temy/754-sochinenie-na-temu-moj-lyubimyj-uchitel',
    image: 'Олег',
    description: 'Все мы знаем, что профессия учителя одна из самых непростых. С одной стороны, может показаться, что ничего сложного в ней нет. Знай себе приходи на уроки и рассказывай каждый год одно и то же, а если кто-то не понимает, ставишь двойку и дело с концом. Это, конечно же, совсем не так. Учителю приходится прикладывать немало сил и энергии, чтобы донести свой предмет до учеников, чтобы найти подход к тем, кто не понимает или не интересуется. Кроме этого, в коллективе, особенно среди подростков, регулярно случаются непростые ситуации, требующие внимания, опыта и терпения, чтобы их решить. Мне повезло, я люблю свою школу и со всеми нашими учителями у меня сложились либо хорошие, либо нейтральные отношения. Но об одном человеке мне бы хотелось упомянуть отдельно. Наш учитель литературы и русского языка. Ему каким-то образом удается приковывать к себе наше внимание на весь урок. Все, что он рассказывает, интересно. Когда мне что-то непонятно, он вызывает к доске, но не для того, чтобы поставить плохую оценку, а чтобы все объяснить, пока я не пойму. Мы не раз обращались к нему за советом, даже если дело касалось не школьных проблем, а бытовых, житейских. Наш любимый учитель ни разу не отказал нам в помощи и всегда находил для нас время. Поэтому у нас установились доверительные отношения. Чтобы сплотить учеников, он устраивает вылазки на природу. Мы берем котелок, тушенку, крупу и варим полевую кашу. Там мы играем в командные игры и очень весело проводим время, а он обычно выступает в роли судьи. Я рад, что мне не встречались учителя, способные испортить жизнь своим ученикам, но еще больше я радуюсь тому, что с нами наш любимый учитель. Это помогает нам идти в школу с радостью, а не по принуждению. Таким образом, мы обрели в его лице не только учителя, но наставника и друга.',
    author: 'Kiryl Duben',
    category: 'topchick',
    releaseDate: '11/08/2020'
  }),

  new News({
    id: 10,
    title: 'Белорусы — "вкусно" одетые люди". Как в Минске называли самых стильных мужчин и женщин страны',
    url: 'https://news.tut.by/culture/503790.html',
    image: 'Костя',
    description: 'Вручение премии «Топ 50 самых стильных мужчин и женщин Беларуси» прошло в «Президент-Отеле» вечером 8 июля. Журнал XXL проводит ежегодную церемонию в четвертый раз. Незадолго до официального начала в холле отеля раздаются звуки музыки и звон бокалов. В ожидании всех приглашенных гости неторопливо гуляют по залу с бокалами в руках. Большинство из присутствующих давно знакомы, поэтому вновь прибывшие быстро находят собеседников и расходятся по компаниям. Главный директор журнала XXL Дмитрий Мякота рассказывает, что в течение года он и его коллеги выбирают самых стильных мужчин и женщин Беларуси. В последние годы, говорит он, белорусы стали стремиться выглядеть лучше. — По сравнению с тем, что было лет 10−15 назад, стильных людей становится все больше. Появляются белорусские бренды, дизайнеры, у белорусов появляется больше выбора. Стиль человека — это этикет, внешний вид, соблюдение дресс-кода, уважение к окружающим. Не обязательно носить вещи известных брендов, чтобы выглядеть хорошо. В этом году жюри состоит из 12 человек, однако судейство было анонимным. «Мы не хотим показывать, кто за кого голосовал. Все друг друга знают, общаются, поэтому пусть личное мнение каждого останется под завесой тайны», — пояснили новую схему голосования хозяева мероприятия. Организатор проекта «Мельница Моды» Игорь Иванов считает, что в стиле важна не только внешность, но и ум, воспитанность, интеллигентность, харизма. Внешнюю красоту можно утратить, а истинные ценности на протяжении всей жизни будут сопровождать человека. — Мы — красивая и умная нация, в мире многие знают о нас по белорусским дизайнерам и моделям, поэтому нам есть чем гордиться.',
    author: 'Kiryl Duben',
    category: 'topchick',
    releaseDate: '11/08/2020'
  }),
]